package doc.stringpostprocessors;

/**
 * Интерфейс. Реализации этих интерфейсов будут дополнительно
 * обрабатывать полученный текст из pdf-файла. Например, в Мытищах
 * у нас пускатели обозначаются точно также, как и автоматы, поскольку русских букв
 * пока нет. И здесь, если за автоматом сразу идет пускатель, его надо удалить.
 * Это необходимо делать сразу после получения текста из фалйа, пока не стали
 * разбивать файл по автоматам и кабелям. Загрузку класса попробуем осуществлять
 * через class.ForName.
 */
public interface StringPostProcessor {
    String postProcess(String text);
}
